RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/peripherals.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PERIPHERALS_H_
#define _PERIPHERALS_H_

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "fsl_edma.h"
#include "stdlib.h"
#include "fsl_memory.h"
#include "fsl_common.h"
#include "fsl_lpuart.h"
#include "fsl_clock.h"
#include "fsl_rgpio.h"
#include "fsl_lpadc.h"

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/
/* Definitions for BOARD_InitPeripherals functional group */
/* Used DMA device. */
#define DMA4_DMA_BASEADDR (EDMA_Type *)DMA4

  /* Channel CH0 definitions */
/* DMA4 eDMA source request. */
#define DMA4_CH0_DMA_REQUEST kDma4RequestMuxADC1Request0
/* Selected eDMA channel number. */
#define DMA4_CH0_DMA_CHANNEL 0
/* TCD pool size */
#define DMA4_CH0_TCD_SIZE 1
/* DMA4 interrupt vector ID (number). */
#define DMA4_DMA_CH_INT_DONE_0_IRQN DMA4_CH0_CH1_CH32_CH33_IRQn
/* Transfer structure index 0 definition */
#define DMA4_CH0_TRANSFER0_CONFIG DMA4_CH0_Transfers_config[0]
/* Definition of peripheral ID */
#define LPUART1_PERIPHERAL LPUART1
/* Definition of the clock source frequency */
#define LPUART1_CLOCK_SOURCE 24000000UL
/* Alias for ADC1 peripheral */
#define ADC1_PERIPHERAL ADC1
/* Command 1 - GRPA */
#define ADC1_GRPA 1U
/* Command 2 - GRPB */
#define ADC1_GRPB 2U
/* Trigger 0 - TRIG */
#define ADC1_TRIG 0U

/***********************************************************************************************************************
 * Global variables
 **********************************************************************************************************************/
#if defined(BSP_USING_DMA)
extern edma_config_t DMA4_config;
/* Destination address extern definition */
AT_NONCACHEABLE_SECTION_ALIGN_INIT(extern uint32_t adc_result[], sizeof(uint32_t));
extern edma_handle_t DMA4_CH0_Handle;
/* Transactional transfer configurations */
extern edma_transfer_config_t DMA4_CH0_Transfers_config[1];
#endif
extern const lpuart_config_t LPUART1_config;
extern const lpadc_config_t ADC1_config;
extern lpadc_conv_command_config_t ADC1_commandsConfig[2];
extern lpadc_conv_trigger_config_t ADC1_triggersConfig[1];
#if defined(BSP_USING_DMA)
/***********************************************************************************************************************
 * Callback functions
 **********************************************************************************************************************/
/* eDMA callback function for the 0 channel.*/
extern void DMA_Callback(edma_handle_t*, void*, bool, uint32_t);
#endif
/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/

void BOARD_InitPeripherals(void);

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void);

#if defined(__cplusplus)
}
#endif

#endif /* _PERIPHERALS_H_ */
